Revit 2026 API

# StructuralSectionGeneralTGetWebThicknessInHeightCenter Method

---

Returns thickness of web measured in the 0.5 * height,

**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double GetWebThicknessInHeightCenter()
```
```vb
Public Function GetWebThicknessInHeightCenter As Double
```
```cpp
public:
double GetWebThicknessInHeightCenter()
```
```fsharp
member GetWebThicknessInHeightCenter : unit -> float
```

#### Return Value

Double

#### Reference

StructuralSectionGeneralT Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace